In [1]:
from google.cloud import bigquery
import pandas as pd

In [2]:
client=bigquery.Client(project="voltaic-syntax-322717")
dataset=client.dataset("test")

# Read

In [3]:
sql1="SELECT * FROM `voltaic-syntax-322717.test.movie` limit 5"

query1=client.query(sql1)
type(query1)

google.cloud.bigquery.job.query.QueryJob

In [4]:
table1=query1.result()
print(type(table1))
print("\n")

for row in table1:
    print(row)

print("\n")
print(type(row))

<class 'google.cloud.bigquery.table.RowIterator'>


Row((1127, 'The Kid', 1921), {'id': 0, 'title': 1, 'year': 2})
Row((1118, 'Metropolis', 1927), {'id': 0, 'title': 1, 'year': 2})
Row((1051, 'City Lights', 1931), {'id': 0, 'title': 1, 'year': 2})
Row((1094, 'M - Eine Stadt sucht einen Mörder', 1931), {'id': 0, 'title': 1, 'year': 2})
Row((1045, 'Modern Times', 1936), {'id': 0, 'title': 1, 'year': 2})


<class 'google.cloud.bigquery.table.Row'>

In [5]:
table1=query1.result()

print("year title")
for row in table1:
    print(str(row.year)+" "+row.title)

year title
1921 The Kid
1927 Metropolis
1931 City Lights
1931 M - Eine Stadt sucht einen Mörder
1936 Modern Times

In [6]:
sql2="SELECT * FROM `voltaic-syntax-322717.test.movie`"
query2=client.query(sql2)

In [7]:
table2=query2.result()
schema=table2.schema
schema

[SchemaField('id', 'INTEGER', 'NULLABLE', None, (), None),
 SchemaField('title', 'STRING', 'NULLABLE', None, (), None),
 SchemaField('year', 'INTEGER', 'NULLABLE', None, (), None)]

In [8]:
table2.total_rows

166

In [9]:
df=query2.result().to_dataframe()
df.head()

     id      title  year
0  1200       Dune  2021
1  1201  Moon Fall  2022
2  1203  Ironman 1  2008
3  1204  Ironman 2  2010
4  1205  Ironman 3  2013

# Write

In [10]:
movie_list=[{u"id":1200,u"title":"Dune",u"year":2021},
           {u"id":1201,u"title":"Moon Fall",u"year":2022}]
client.insert_rows_json(table="voltaic-syntax-322717.test.movie",json_rows=movie_list)

[]

In [11]:
movie_df=pd.read_csv("movie.csv")
movie_df.head()

     id      title  year
0  1203  Ironman 1  2008
1  1204  Ironman 2  2010
2  1205  Ironman 3  2013

In [12]:
client.insert_rows_from_dataframe(table="voltaic-syntax-322717.test.movie"
                                  ,dataframe=movie_df,selected_fields=schema)

[[]]